#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>

//表达式求值
//int main()
//{
//	//int a = 2 + 6 / 3;//先算除法，再算加法(优先级)
//	//int b = 2 + 3 + 4;//
//
//	char a = 5;
//	//00000000000000000000000000000101 整形5的补码
//	//00000101 截断后的char类型5的存放
//	//
//	char b = 126;
//	//00000000000000000000000001111110 整形126的补码
//	//01111110 截断char里的5
//
//	char c = a + b;
//	//此处当a+b时,需要按规则将a,b作则整形提升再截断
//	//00000000000000000000000000000101 -- a
//	//00000000000000000000000001111110 -- b
//	//00000000000000000000000010000011 -- c=a+b
//	//10000011   -- c截断之后
//	printf("%d\n", c);// -125
//	//按照整形打印出来,需要再次整形提升
//	//11111111111111111111111110000011 -- (经过补转反转原)对应-125
//	//上边的步骤就是隐式类型转换的一个例子
//	//char的范围在 -128~127之间,几个整形相加之后没有超过该范围,可以直接得出结果
//
//	return 0;
//}

int main()
{
    char ch = 0;
    while (scanf("%c", &ch) == 1)
    {
        if (ch >= 'a' && ch <= 'z')
            printf("%c\n", ch - 32);
        if (ch >= 'A' && ch <= 'Z')
            printf("%c\n", ch + 32);
    }

    return 0;
}