#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//int main()
//{
//	//数组的定义:type_t  arr_name   [const_t]
//	int arr[12];
//	char ch[10];
//	double date[10];
//
//	//在C99之前，数组大小的指定必须是常量或者常量表达式
//	//在C99之后，数组的大小可以是变量，这是为了支持边长数组(不能初始化)，即可以输入指定数组长度
//		 
//	//数组的初始化，在创建数组的的同时给数组内一些合理的初始值
//	int arr[10] = { 1,2,3 };//不完全初始化，剩余的元素默认初始化为0
//	int arr1[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
//
//	char ch1[10] = { 'a','b','c' };//剩余的元素会由0-->'\0'填充
//	char ch2[10] = "abc";//和上边的初始化方式等价//会多个 \0
//	char ch3[] = { 'a','b','c' };
//	char ch4[] = "abc";//四个元素，字符串默认有个 \0,也就是有四个元素//
//	return 0;
//}


//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
//	// []为下标引用操作符
//	int i = 0;
//	int j = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (i = 0; i < sz; i++)
//	{
//		printf("arr[%d] = %d\n",i, arr[i]);
//	}
//	for (j = 0; j < sz; j++)
//	{
//		printf("&arr[%d] = %p\n", j, &arr[j]);//%p打印地址
//	}
//	return 0;
//}

//二维数组的创建
	//1 2 3 4
	//2 3 4 5
	//3 4 5 6  
int main()
{
	//二维数组的创建及初始化
	int arr[3][4] = {1,2,3,4,2,3,4,5,3,4,5,6};//完全初始化
	int arr1[3][4] = { {1,2},{3,4,2,3},{4,5} };//二维数组初始化的方式分组，让第一行，第二行分别填充想要的
	char arr2[5][10];
	//二位数组初始化时可以省略行而不能省略列

	//二维数组的使用
	int i = 0;
	for (i = 0; i < 3; i++)
	{
		int j = 0;
		for (j = 0; j < 4; j++)
		{
			printf("%d ",arr[i][j]);
		}
		printf("\n");
	}
	return 0;
}